{
  "backend/main.mo": "Main backend actor implementing marketplace logic with user profiles, item management (create, list, purchase), artist profiles, NFT tracking, and role-based access control using authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting implementation of enhanced error logging and user-friendly error messages in authentication and user creation flows across frontend components.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing components, pages, hooks, and styling with emphasis on error handling, authentication flows, and marketplace functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining design tokens for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point for the Artisan Marketplace application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for browse, upload, items, profiles, purchase flows, and wrapping with ThemeProvider and Toaster for notifications.",
  "frontend/src/components/EmptyState.tsx": "Reusable empty state component displaying an illustration, title, description, and optional action button for scenarios with no data.",
  "frontend/src/components/FilePreview.tsx": "File preview component that detects file type from blob signature (image, audio, 3D model) and renders appropriate preview with proper Uint8Array to Blob conversion for images.",
  "frontend/src/components/ItemCard.tsx": "Item card component displaying preview image, title, description, price, category badge, sold status, and navigation to item detail page on click.",
  "frontend/src/components/ItemGrid.tsx": "Responsive grid layout wrapper component for displaying item cards in 1-4 columns based on screen size.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper providing navigation header, content area, footer with attribution link, and profile setup modal integration.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, toggling between login and logout states with loading indicators and error handling including retry logic for authentication failures.",
  "frontend/src/components/Navigation.tsx": "Main navigation header component with responsive design that conditionally displays navigation links based on authentication status and user profile (artist vs regular user), includes mobile sheet menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that appears for authenticated users without profiles, collecting name, bio, and artist status to create their initial user profile with comprehensive error handling.",
  "frontend/src/components/PurchaseButton.tsx": "A button component that displays different states (login required, owner, sold out, or purchase) and opens a purchase modal for available items when clicked by authenticated non-owner users.",
  "frontend/src/components/PurchaseModal.tsx": "A confirmation dialog for item purchases that displays price breakdown with transaction fees, handles the purchase mutation, and redirects to confirmation page on success.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, switching between anonymous and authenticated actors based on identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing auth client lifecycle, identity state, login/logout flows, and providing authentication status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, artist profiles, items, and NFT ownership data via the backend actor. Includes comprehensive error handling and logging for profile operations, item creation, and purchases.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a warm earthy color palette (terracotta, sage green, cream) for both light and dark modes. Sets typography with Inter for body text and Playfair Display for headings.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and wraps the App component with InternetIdentityProvider and QueryClientProvider for authentication and data fetching.",
  "frontend/src/pages/ArtistProfilePage.tsx": "Displays an artist's profile page with avatar, statistics (active listings, items sold, total sales), and separate sections for active and sold items from their gallery.",
  "frontend/src/pages/BrowsePage.tsx": "Main marketplace browsing page with hero banner and category filtering (all, digital art, physical, NFTs, crafts). Currently returns empty items array as backend lacks getAllItems endpoint.",
  "frontend/src/pages/EditProfilePage.tsx": "Profile editing form allowing authenticated users to update their name, bio, and artist status. Includes authentication checks and redirects with toast notifications for success/error states.",
  "frontend/src/pages/ItemDetailPage.tsx": "Item detail page showing full item information including image preview, price, type badge, NFT ownership data, and purchase button. Displays sold status and owner information when applicable.",
  "frontend/src/pages/MyItemsPage.tsx": "Displays an artist's uploaded items with management actions; currently returns empty array as backend doesn't expose getMyItems endpoint. Requires authentication and artist profile to access.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Shows a success confirmation page after item purchase with order details and navigation options to purchase history or browse page.",
  "frontend/src/pages/PurchaseHistoryPage.tsx": "Displays user's purchase and sales history with summary statistics; currently returns empty arrays as backend doesn't expose purchase/sales history queries.",
  "frontend/src/pages/UploadPage.tsx": "Provides multi-file upload interface for artists to create items with metadata (title, description, price, type); processes files asynchronously with progress tracking and batch upload support.",
  "frontend/src/utils/fileProcessing.ts": "Utility functions for asynchronous file processing including reading files as Uint8Array, batch processing with delays, and UI yielding to prevent blocking.",
  "frontend/src/utils/urlParams.ts": "Utilities for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH), fonts (Inter/Playfair Display), animations, and plugins for typography and container queries.",
  "project_state.json": "Project state tracking file for an MVP marketplace supporting digital art, physical products, IC-native NFTs, and craft items with bulk upload, mock payments, and artist profiles. Currently at version 7 with a known issue where user creation fails during signup and login after Version 2 deployment."
}